#4) რა არის debuging? ასევე გაასწორე ეს Eror ები:
# debugging არის კოდში შეცდომების გასწორება

#1)
name = 'zura'
print(name) # აქ ცვლადი არ გვაქვს ჩაწერილი
#2)
age = 13
print(age) # - არ ვიყენებთ ეს არის შეცდომა. უნა დავწეროთ ტოლობის ნიშანი და {} არის შეცდომა
#3)
Hello_world = "Hello"
print(Hello_world) # ცვლადის სიტყვის გამოტოვება არ შეიძლება
#4)
name2 = 'nika'
print(name2) # ციფრით დაწყება არ შეიძლება
#5)
year = 2025 # შეცდომა: year > 2025. მაგის მაგივრათ უნდა დავწეროთ ტოლობის ნიშანი
print(year) 