// 1)შექმენით  რიცხვების სია, და მასში დააჯამეთ რიცხვები reduce ის გამოყენებით
let arr = [1,2,3,4,5,6,7]
let arr2 = arr.reduce((el,el2) => el+el2)

// 2)შექმენით სია სადაც იქნება ბევრი სტრინგი, ეს სტრინგეი უნდა იყოს განაწილებული რომ სიტყვა გამოვიდეს

// და შეემდეგ reduce ით ეს სტრინგები გააერთიანდე

let arr1 = ['n', 'i', 'g', 'g', 'e', 'r']
let arr3 = arr1.reduce((el,el2) => `${el}${el2}`)

// 3)შექმენით სია რიცხვებით სავსე, და შემდეგ ამ სიის  საშუალო არითმეტიკული გამოითვალეთ 
let arrr = [1,2,3,4,5]
let arrr2 = arrr.reduce((el,el2) => {
    return el+el2
})
let uhh = arrr2/arrr.length
console.log(uhh)

// ჯამი გაყოფილი სიგრძეზე