# შესავალი: პითაგორას თერომა, ქვემოთაა მოცემული მართკუთხა სამკუთხედი, მას ააქვს სამი გვერდი, a, b, c
# c გვერდს ქვია ჰიპოტენუზა
# ჩვენ ვიცით მარტო a და b
# იმისათვის რომ გამოვითვალოთ ამ სამკუთხედის ჰიპოტენუზა, გამოიყენება ფორმულა
# a²+b²=c²
# მაგ a = 2 და b = 4
# 2
# 2²+4²=c²
# 4+16=c²
# 20=c²
# c=√20(20 ის ფესვი) ანუ კვადრატი გადავიდა ოცთან და გადაიქცა ფესვად,
# მაგ:
# 5²=25
# 5=√25
# 5=5

# თვენი დავალებაა შექმნათ ფუნქცია, რომელსაც გადაეცემა ორი არგუმენტი, a და b, მართკუთხა სამკუთხედის ორი გვერდის სიგრძე, და უნდა გამოითვალოს ამ მართკუთხა სამკუთხედის მესამე გვერდის ანუ ჰიპოტენუზის სიგრძე

def random(a,b):
    return (a**2+b**2) ** 0.5
print(random(5,5))