# 3)შექმენი სია 15 ცალი ელემენტით, პირველი 5 იყოს სტრინგი და ეწეროს სააქართველოს ქალაქები,
#  მეორე 5ეული იყოს რიცხვები და ეწეროს თქვენი ოჯახის წევრების ასაკები(ან ნათესავების), მესამე 5ეული იყოს boolean ები(True False),
#  შემდეგ შექმენით სამი ცვლადი სადაც იქნება input და მომხარებელს შემოატანინეთ რაიმე მნიშვნელობა, შემდგომ სიაში მე 4 ელემენტი
#  მე 7 ელემენტი და მე 11 ელემენტი შეცვალეთ ამ სამი input ით

words = ["თბილისი", "ბათუმი", "ქუთაისი", "რუსთავი", "ზუგდიდი",1,2,3,4,5,True, False, True, False, True]

words[3]=input("enter something ")
words[6]=input("enter something ")
words[10]=input("enter something ")

print(words)