// პირობა: აიღე პირველი ელემენტი ცალკე და დანარჩენი ჩასვი rest მასივში. დაბეჭდე ორივე.
// let arr = [1,2,3,4,5]
// let [first,...rest] = arr
// console.log(first,rest)

// 2) მასივი (გამოტოვება)

// პირობა: მასივიდან აიღე მხოლოდ მეორე და მესამე ელემენტი, დანარჩენი ჩასვი rest-ში.
// let obj = {
//     one: 1,
//     two: 2,
//     third: 3
// }
// let {two,third,...rest} = obj
// console.log(rest)

// 3) ობიექტი (ორი თვისება)

// პირობა: ობიექტიდან აიღე ორი კონკრეტული თვისება ცალკე, დანარჩენი ჩასვი restObj-ში.
// let obj = {
//     one: 1,
//     two: 2,
//     three: 3,
//     four: 4
// }
// let {one,two,...rest} = obj
// console.log(rest)

// 4) ფუნქცია (დათვლა)

// პირობა: შექმენი ფუნქცია, რომელიც იღებს რამდენი რიცხვსაც ჩაუშვებ და აბრუნებს რამდენი რიცხვი მიიღო (სიგრძე).
// function counter(...num){
//     return num.length
// }
// console.log(counter(1,2,3,4,5))

// 5) ფუნქცია (ჯამი)

// პირობა: შექმენი ფუნქცია, რომელიც იღებს რამდენი რიცხვსაც ჩაუშვებ და აბრუნებს მათ ჯამს.
// function sum(...num){
//     return num.reduce((first,second) => first+second)
// }
// console.log(sum(1,2,3,4,5))