# 1) მომხმარებელს შემოატანინე სახელი, გვარი, ასაკი, 
# და შემდეგ დაპრინტე

# ასევე  მომხმარებელს შემოატანინე 2 რიცხვი, და ერთმანეთს მიუმატე გამოაკელი გაამრავლე და გაყავი. 
name1 = input("შეიყვანეთ სახელი: ")
name2 = input("შეიყვანეთ გვარი: ") 
name3 = input("შეიყვანეთ ასაკი: ")
print("თქვენი სახელი არის: ", name1)
print("თქვენი გვარია: ", name2)
print("თქვენი ასაკია: ", name3)
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))
print(num1 + num2)
print(num1-num2)
print(num1*num2)