# 6)შექმენით ფუნქცი def ით, რომელსაც გადაეცემა ერთი არგუმენტი, ფუნქცია, და მეორე სია, შემდეგ ფორ ლუპით გადაუარეთ ამ სიას და თითოეულ ელემენტზე გამოიყენეთ პირველი ფუნქცია,
# და ახალ სიაში ჩაამატეთ შემდეგ დააბრუნეთ, საბოლოოდ გამოიძახეთ ეს ფუნქცია და პირველ არგუმენტად გადაეცი lambda რომელიც გაამრავლებს რიცხვებს 5 ზე, და მეორე არგუმენტად გადაეცით რიცხვების სია
def map_copy(func, numbers):
    new_list = []
    for i in numbers:
        new_list.append(func(i))
    return new_list

lstn = [1,2,3,4,5]

new = map_copy(lambda x: x * 5, lstn)
print(new)