# 1) კომენტარის სახით ახსენით თუ რას აკეთებს type() ფუნქცია.
# type ფუნქცია ამოწმებს მონაცემის ტიპს

# 2) შექმენით 5 ცვლადი და შეინახეთ სხვადასხვა მონაცემთა ტიპები. შემდეგ კი შეამოწმეთ თითოეული ცვლადი რომელ მონაცემთა ტიპს ინახავს და გამოიტანეთ შედეგი ეკრანზე.
name="demetre"
age=14
height=182.1
knows_programming=True
surname="maisuradze"
print(type(name))
print(type(age))
print(type(height))
print(type(knows_programming))
print(type(surname))

# 3) შექმენით ორი ცვლადი, რომელშიც შეინახავთ ინტეჯერ რიცხვებს და შემდეგ მათ შორის განახორციელეთ ყველა შესაძლო მათემატიკური ოპერაცია.( შეინახეთ თითოეული ოპერაციის შედეგი ცვლადებში)
num1=10
num2=15
print(num1+num2)
print(num1*num2)
print(num1/num2)
print(num1-num2)

#4) მესამე დავალების შესრულების შემდეგ შეამოწმეთ თუ რა იქნება თითოეული ოპერაციის შედეგი და გამოიტანეთ ეკრანზე .
print(25)
print(150)
print(0.66666666666)
print(-5)
