# 2)შექმენით ფუნქცია რომელიც იღებს 2 რიცხვს, სიგრძეს და სიგანეს მართკუთხედის, შემდეგ დააბრუნეთ 2 რიცხვი, ამ მართკუთხედის პერიმეტრი და ფართობი
# როგორ გამოითლება მართკუთხედის ფართობი:მისი სიგრძე უნდა გავამრავლოთ მის სიგანეზე
# როგორ გამოითვლება მართკუთხედის პერიმეტრი:2*(სიგრძე+სიგანე)
# შემდეგ, ერთ ხაზზე შექმენით 2 ცვლადი, და გაუტოლეთ ამ ფუნქციის გამოძახებას
# perimeter, area = my_func(100, 50)
# შემდეგ დაწერეთ კომენტარებით რას უდრის თითოეული

def my_function(q,w):
    perimeter = 2*(q+w)
    area = q*w
    print(perimeter)
    print(area)
    return perimeter, area
perimeter, area = my_function(100,50)