// 6)შექმენით random position div, გვქონდეს რაიმე ერთი დივი, გასტილეთ, შემდეგ იყოს h1 "do you love me?" ღილაკი ამ დივის შიგნით, no,
//  ამ ღილაკის დაჭერაზე ეს დივი გადაადგილდეს random პოსიზიაცე ეკრანის ფარგლებში, ასევე იყოს ღილაკი yes, რომლის დაჭერაზეც ეს დივი გაქრება
//  და გამოჩნდება სხვა დივი(ისიც შექმენით) რომელშიც ეწერება i thought so, შეყვარუებლუებს ჩაუგდეთ მერე გაუხარდებათ😂
const no = document.getElementById('no') // no btn
const div = document.getElementById('random') // div random
const div2 = document.getElementById('random2')
const yes = document.getElementById("yes")
no.onclick = function(){
    let randos = Math.floor(Math.random() * 1000 - 500)
    div.style.left = `${randos}px`
    div.style.top = `${randos}px`
    console.log(randos)
}
yes.onclick = function(){
    div.style.display = 'none'
    div2.style.display = 'flex'
}