# 1) კომენტარის სახით ჩამოწერეთ ყველა ნასწავლი მონაცემთა ტიპი და თითოეულს გვერდზე მიუწერეთ მაგალითი.
#string-str name="demetre"
#integer-int number=12
#float number2=3.5
#boolaen knows_programming

#2) გაასწორეთ მოცემული კოდი:
num1 = 19 #str+int არ შეიძლება ან str+str ან int+int
num2 = 59
print(num1 + num2)
#ამასთანავე, კომენტარის სახით მიუწერეთ, თუ რატომ არის პირვანდელი კოდი არასწორი.

#3) შექმენით 4 სხვადასხვა ცვლადი, რომელშიც შეინახავთ სიტყვებს. გამოიყენეთ თქვენს მიერ შექმნილი ცვლადები  და შემდეგ print ფუნქციისა და კონკატინაციის მეშვეობით დაბეჭდეთ რამდენიმე წინადადება. 
number0=100
number1=14
number2=142
number3=9
print(number0+number1+number2+number3)