// 1) მასივი + rest

// პირობა: აიღე პირველი 2 ელემენტი ცალკე, დანარჩენი ჩასვი rest მასივში. დაბეჭდე ყველაფერი.
// let arr = [1,2,3,4,5]
// let [first,...rest] = arr
// console.log(first,rest)

// 2) ობიექტი + rest

// პირობა: აიღე ერთი თვისება ცალკე, დანარჩენი ჩასვი restObj ობიექტში. დაბეჭდე ორივე.
// let obj = {
//     one: '1',
//     two: '2',
//     three: '3'
// }

// let {one,...restObj} = obj
// console.log(one,restObj)

// 3) ფუნქცია + rest

// პირობა: შექმენი ფუნქცია, რომელიც მიიღებს რამდენი რიცხვსაც ჩაუშვებს მომხმარებელი, ჩასვამს მათ rest მასივში და დაბეჭდავს.
// function uhh(...rest){
//     return rest
// }
// console.log(uhh(1,2,3,4,5))

// 4) გამრავლება + rest

// პირობა: შექმენი ფუნქცია, რომელიც იღებს რამდენი რიცხვსაც მომხმარებელი ჩაუშვებს, ჩასვამს მათ მასივში და გამრავლებს ერთმანეთზე.
// function uhh(...rest){
//     return rest.reduce((a,b) => {
//         return a * b
//     })
// }

// console.log(uhh(1,2,3,4,5))

// 5) ობიექტი + ფუნქცია + rest

// პირობა: შექმენი ფუნქცია, რომელიც იღებს ობიექტს, ერთ თვისებას ცალკე გამოიტან და დანარჩენს ჩასვამს ახალ ობიექტში. დაბეჭდე ორივე ნაწილი.
// function uhh(obj){
//     let {one,...rest} = obj
//     return one,rest 
// }

// console.log(uhh({
//     one: 1,
//     two: 2,
//     three: 3
// }))
