// 1) მასივების რეფერენსი

// პირობა: შექმენი ახალი მასივი, რომელიც უბრალოდ „სარკეა“ საწყისის. დაამატე ახალი ელემენტი და ნახე ორივე მასივი როგორ შეიცვალა.
// let arr = [1,2,3,4,5]
// let arr1 = arr
// arr1.push('ni-')
// console.log(arr) 

// 2) spread ოპერატორი მასივზე

// პირობა: შექმენი ახალი მასივი, რომელიც შეიცავს ძველს + დამატებით ელემენტებს. დაამატე კიდევ ერთი ელემენტი ახალ მასივში და ნახე ძველი მასივი არ შეცვლილა.
// let arr = [1,2,3,4,5]
// let arr1 = [...arr]
// arr1.push('ni-')
// console.log(arr)

// 3) ობიექტების რეფერენსი

// პირობა: შექმენი ახალი ობიექტი, რომელიც უბრალოდ რეფერენსია ძველ ობიექტზე. დაამატე ახალი თვისება ახალ ობიექტში და ნახე ძველი ობიექტი როგორ შეიცვალა.
// let obj = {
//     one: '1',
//     two: '2'
// }
// let obj1 = obj
// obj1.three = '3'
// console.log(obj.three)

// 4) spread ოპერატორი ობიექტზე

// პირობა: შექმენი ახალი ობიექტი, რომელიც კოპირებს ძველ ობიექტს და დაამატე ახალი თვისება. შეამოწმე, რომ ძველი ობიექტი არ შეცვლილა.
// let obj = {
//     one: '1',
//     two: '2'
// }
// let obj1 = {...obj}
// obj1.three = '3'
// console.log(obj.three) undefined

// 5) ელემენტების სწრაფი დამატება

// პირობა: გამოიყენე spread ოპერატორი, რომ ძველი მასივი გადააკეთო ახალში და დაამატო რამდენიმე ახალი ელემენტი ერთ ნაბიჯში.
// let arr = [1,2,3,4,5]
// let arr1 = [...arr]
// for (let i = 0; i < 5; i++) {
//     arr1.push(i)
// }